In [1]:
import pandas as pd
import numpy as np
from datetime import datetime
from datetime import timedelta
from dateutil.parser import parse

In [3]:
rng = pd.date_range('1/1/2000', periods=100, freq='D')
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts.resample('M').mean()

2000-01-31    0.163768
2000-02-29   -0.019010
2000-03-31    0.030123
2000-04-30    0.318710
Freq: M, dtype: float64

In [4]:
ts.resample('M', kind='period').mean()

2000-01    0.163768
2000-02   -0.019010
2000-03    0.030123
2000-04    0.318710
Freq: M, dtype: float64

In [5]:
rng = pd.date_range('1/1/2000', periods=12, freq='T')
ts = pd.Series(np.arange(12), index=rng)
ts

2000-01-01 00:00:00     0
2000-01-01 00:01:00     1
2000-01-01 00:02:00     2
2000-01-01 00:03:00     3
2000-01-01 00:04:00     4
2000-01-01 00:05:00     5
2000-01-01 00:06:00     6
2000-01-01 00:07:00     7
2000-01-01 00:08:00     8
2000-01-01 00:09:00     9
2000-01-01 00:10:00    10
2000-01-01 00:11:00    11
Freq: T, dtype: int64

In [6]:
ts.resample('5min').sum()

2000-01-01 00:00:00    10
2000-01-01 00:05:00    35
2000-01-01 00:10:00    21
Freq: 5T, dtype: int64

In [19]:
ts.resample('5min', closed='right').sum()

1999-12-31 23:55:00     0
2000-01-01 00:00:00    15
2000-01-01 00:05:00    40
2000-01-01 00:10:00    11
Freq: 5T, dtype: int64

In [20]:
ts.resample('5min', closed='right', label='right').sum()

2000-01-01 00:00:00     0
2000-01-01 00:05:00    15
2000-01-01 00:10:00    40
2000-01-01 00:15:00    11
Freq: 5T, dtype: int64

In [21]:
ts.resample('5min', closed='right', label='right', loffset='-1s').sum()

1999-12-31 23:59:59     0
2000-01-01 00:04:59    15
2000-01-01 00:09:59    40
2000-01-01 00:14:59    11
Freq: 5T, dtype: int64

In [22]:
ts.resample('5min').ohlc()

                     open  high  low  close
2000-01-01 00:00:00     0     4    0      4
2000-01-01 00:05:00     5     9    5      9
2000-01-01 00:10:00    10    11   10     11

In [23]:
rng = pd.date_range('1/1/2000', periods=100, freq='D')
ts = pd.Series(np.arange(100), index=rng)
ts.groupby(lambda x: x.month).mean()

1    15
2    45
3    75
4    95
dtype: int64

In [24]:
ts.groupby(lambda x: x.weekday).mean()

0    47.5
1    48.5
2    49.5
3    50.5
4    51.5
5    49.0
6    50.0
dtype: float64

In [25]:
frame = pd.DataFrame(np.random.randn(2, 4), index=pd.date_range('1/1/2000', periods=2, freq='W-WED'), columns=['Colorado', 'Texas', 'New York', 'Ohio'])
frame

            Colorado     Texas  New York      Ohio
2000-01-05  0.589545 -0.527887  1.045947 -1.315089
2000-01-12  0.622831  0.716216 -1.126071 -0.480306

In [27]:
df_daily = frame.resample('D').asfreq()
df_daily

            Colorado     Texas  New York      Ohio
2000-01-05  0.589545 -0.527887  1.045947 -1.315089
2000-01-06       NaN       NaN       NaN       NaN
2000-01-07       NaN       NaN       NaN       NaN
2000-01-08       NaN       NaN       NaN       NaN
2000-01-09       NaN       NaN       NaN       NaN
2000-01-10       NaN       NaN       NaN       NaN
2000-01-11       NaN       NaN       NaN       NaN
2000-01-12  0.622831  0.716216 -1.126071 -0.480306

In [29]:
frame.resample('D').ffill()

            Colorado     Texas  New York      Ohio
2000-01-05  0.589545 -0.527887  1.045947 -1.315089
2000-01-06  0.589545 -0.527887  1.045947 -1.315089
2000-01-07  0.589545 -0.527887  1.045947 -1.315089
2000-01-08  0.589545 -0.527887  1.045947 -1.315089
2000-01-09  0.589545 -0.527887  1.045947 -1.315089
2000-01-10  0.589545 -0.527887  1.045947 -1.315089
2000-01-11  0.589545 -0.527887  1.045947 -1.315089
2000-01-12  0.622831  0.716216 -1.126071 -0.480306

In [31]:
frame.resample('D').ffill(limit=2)

            Colorado     Texas  New York      Ohio
2000-01-05  0.589545 -0.527887  1.045947 -1.315089
2000-01-06  0.589545 -0.527887  1.045947 -1.315089
2000-01-07  0.589545 -0.527887  1.045947 -1.315089
2000-01-08       NaN       NaN       NaN       NaN
2000-01-09       NaN       NaN       NaN       NaN
2000-01-10       NaN       NaN       NaN       NaN
2000-01-11       NaN       NaN       NaN       NaN
2000-01-12  0.622831  0.716216 -1.126071 -0.480306

In [32]:
frame.resample('W-THU').ffill()

            Colorado     Texas  New York      Ohio
2000-01-06  0.589545 -0.527887  1.045947 -1.315089
2000-01-13  0.622831  0.716216 -1.126071 -0.480306

In [34]:
frame = pd.DataFrame(np.random.randn(24, 4), index=pd.period_range('1-2000', '12-2001', freq='M'), columns=['Colorado', 'Texas', 'New York', 'Ohio'])
frame.head(5)

         Colorado     Texas  New York      Ohio
2000-01 -0.187150 -0.566963  1.400469  1.021114
2000-02  0.474078 -0.715680 -1.636371 -0.743504
2000-03  0.258344 -1.335493  0.366777 -0.229246
2000-04 -1.291505 -0.173126 -1.132365 -0.058098
2000-05  0.499979  1.079835  1.713287 -1.737803

In [35]:
annual_frame = frame.resample('A-DEC').mean()
annual_frame

      Colorado     Texas  New York      Ohio
2000  0.122066 -0.090356  0.434206 -0.235698
2001  0.153146 -0.163132  0.309016 -0.182372

In [36]:
annual_frame.resample('Q-DEC').ffill()

        Colorado     Texas  New York      Ohio
2000Q1  0.122066 -0.090356  0.434206 -0.235698
2000Q2  0.122066 -0.090356  0.434206 -0.235698
2000Q3  0.122066 -0.090356  0.434206 -0.235698
2000Q4  0.122066 -0.090356  0.434206 -0.235698
2001Q1  0.153146 -0.163132  0.309016 -0.182372
2001Q2  0.153146 -0.163132  0.309016 -0.182372
2001Q3  0.153146 -0.163132  0.309016 -0.182372
2001Q4  0.153146 -0.163132  0.309016 -0.182372

In [38]:
annual_frame.resample('Q-DEC', convention='end').ffill()

        Colorado     Texas  New York      Ohio
2000Q4  0.122066 -0.090356  0.434206 -0.235698
2001Q1  0.122066 -0.090356  0.434206 -0.235698
2001Q2  0.122066 -0.090356  0.434206 -0.235698
2001Q3  0.122066 -0.090356  0.434206 -0.235698
2001Q4  0.153146 -0.163132  0.309016 -0.182372

In [39]:
annual_frame.resample('Q-MAR').ffill()

        Colorado     Texas  New York      Ohio
2000Q4  0.122066 -0.090356  0.434206 -0.235698
2001Q1  0.122066 -0.090356  0.434206 -0.235698
2001Q2  0.122066 -0.090356  0.434206 -0.235698
2001Q3  0.122066 -0.090356  0.434206 -0.235698
2001Q4  0.153146 -0.163132  0.309016 -0.182372
2002Q1  0.153146 -0.163132  0.309016 -0.182372
2002Q2  0.153146 -0.163132  0.309016 -0.182372
2002Q3  0.153146 -0.163132  0.309016 -0.182372